# IsMasking Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegion..::..IsMasking Property
FilledRegion Class See Also
---
Indicates whether this element is a 'Filled Region or a 'Masking Region'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsMasking { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsMasking As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsMasking {
	bool get ();
}
```

# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace